name: 'LoadSimNetwork'
layer { 
  name: 'data' 
  type: 'DummyData' 
  dummy_data_param { 
    shape { 
      dim: 1024
      dim: 1024
      dim: 1
      dim: 1
    } 
    data_filler { 
      type: 'gaussian' 
      std: 0.01 
    } 
  } 
  top: 'data' 
}
layer { 
  name: 'innerproduct' 
  type: 'InnerProduct' 
  inner_product_param { 
    num_output: 1024
    weight_filler { 
      type: 'gaussian' 
      std: 0.01 
    } 
    bias_term: false
  } 
  bottom: 'data' 
  top: 'innerproduct' 
}
